Repository: joshanashakya/literature_review
Catalog: workspace/opus_corpus/compiled/ted2020v1/en-ne.tmx
Source language: en
Languages: ne

source: And my brother and I were raised with all that you really need: love, strong values and a belief that with a good education and a whole lot of hard work, that there was nothing that we could not do.
ne: अनि म र मेरो दाजु कसैलाई साँच्चै जरुरत हुने कुराहरू दिएर हुर्काइयौँ : माया, कडा मान्यताहरू अनि एउटा विश्वास, कि राम्रो शिक्षा, र धेरै मेहेनतले , हामीले गर्न नसकिने चीज केही पनि छैन।

source: I am an example of what's possible when girls from the very beginning of their lives are loved and nurtured by the people around them.
ne: के सम्भव छ भन्नेकुराको म एउटा उदाहरण हुँ जब केटीहरुले सानै उमेरदेखि आफ्नो वरिपरिका व्यक्तिहरूबाट माया, स्याहार र प्रेरणा पाउँछन।

source: I was surrounded by extraordinary women in my life: grandmothers, teachers, aunts, cousins, neighbors, who taught me about quiet strength and dignity.
ne: मा सानोमा अतिनै-क्षमतापूर्ण महिलाहरूबाट घेरिएकी थिएँ। हजुरआमाहरू, शिक्षिकाहरू, सानीमाहरु, मामा-काका-फुपू-काकी-का छोरीहरू , छिमेकीहरू जसले मलाई अघि बढ्न चहिने हिम्मत र मर्यादाका बारेमा धेरै सिकाए।

source: And my mother, the most important role model in my life, who lives with us at the White House and helps to care for our two little daughters, Malia and Sasha.
ne: अनी मेरी आमा, मेरो जीवनको सबभन्दा महत्वपूर्ण व्यक्तित्व, जो अहिले हामीसँगै "व्ह्वाइट हाउश" मा बस्नुहुन्छ र हाम्रा दुई छोरी मलिआ र साषा लाई हुर्काउन मद्दत गर्नुहुन्छ।

source: She's an active presence in their lives, as well as mine, and is instilling in them the same values that she taught me and my brother: things like compassion, and integrity, and confidence, and perseverance -- all of that wrapped up in an unconditional love that only a grandmother can give.
ne: उहाँ मेरो र उनिहरुको जीवनमा उपस्थित रहनुहुन्छ, र उनिहरुलाई सिकाउनुहुन्छ तिनै मान्यताहरू जुन उहाँले म र मेरो दाजुलाई सिकाउनुभएको थियो: प्रेम र मर्यादा जस्ता कुरा, अनी हिम्मत, र जेहेन्दारीका कुरा। उहाँ ती सबै नि:स्वार्थ मायाले बेरेर दिनुहुन्छ जुन केवल एउटा हजुरआमाले मात्र दिन सक्छिन।

source: I was also fortunate enough to be cherished and encouraged by some strong male role models as well, including my father, my brother, uncles and grandfathers.
ne: हौशला र उत्साह पाउने म साँच्चै भाग्यशाली थिएँ केही उच्चतम पुरुष व्यक्तित्वबाट पनि मेरा बुवा, मेरा दाजु , मेरो काकाहरू र हजुरबुवाहरु।

source: The men in my life taught me some important things, as well.
ne: मेरा जिन्दगीमा उहाँहरूले पनि मलाई धेरै महत्वपूर्ण कुराहरु सिकाउनुभयो।

source: They taught me about what a respectful relationship should look like between men and women.
ne: उहाँहरुले मलाई मर्यादित सम्बन्ध कस्तो हुन्छ भनेर सिकाउनुभयो महिला र पुरुष बिचको सम्बन्ध।

source: They taught me about what a strong marriage feels like: that it's built on faith and commitment and an admiration for each other's unique gifts.
ne: उहाँहरूले मलाई एउटा दरिलो दाम्पत्य जीवन कस्तो हुन्छ भनेर सिकाउनुभयो। कि त्यो विश्वाश र एक अर्काप्रतिको समर्पणमा बनेको हुन्छ, र त्यसमा एक अर्कामा भएको पृथक गुणहरूको तारिफ हुन्छ भनेर।

source: They taught me about what it means to be a father and to raise a family.
ne: उहाँहरूले मलाई सिकाउनुभयो एउटा बाबु कसरी बन्ने र कसरी परिवार हुर्क्याउने भनेर।

source: And not only to invest in your own home but to reach out and help raise kids in the broader community.
ne: अनी सिकाउनुभयो आफ्नो घर-परिवार मा मात्रै लगानी गर्न होइन कि अरु बच्चाहरू पनि हुर्क्याउन मद्दत गर्न आफ्नो समुदायमा।

source: And these were the same qualities that I looked for in my own husband, Barack Obama.
ne: यिनै गुणहरु थिए जसलाई म आफ्नो पति, बराक ओबामामा खोज्थें।

source: And when we first met, one of the things that I remember is that he took me out on a date.
ne: अनि जब हामी पहिलो चोटि भेट्यौं, मैले सम्झेको एउटा कुरा के हो भने उहाँले मलाई "डेट" मा बहिर लिएर जानुभयो।

source: And his date was to go with him to a community meeting.
ne: अनि यो "डेट"मा म उहाँसँग एउटा सामाजिक भेलामा जानुपर्ने थियो।

source: (Laughter) I know, how romantic.
ne: (हाँसो) मलाई थाहा छ ,कस्तो रोमान्चक हगि?

source: (Laughter) But when we met, Barack was a community organizer.
ne: (हाँसो) तर जब हामीले भेटेका थियौँ , बराक एउटा सामाजिक कार्यकर्ता हुनुहुन्थ्यो।

source: He worked, helping people to find jobs and to try to bring resources into struggling neighborhoods.
ne: उहाँ अरुको लागि काम खोज्ने काम गर्नुहुन्थ्यो अनि गरीब छर-छिमेकमा श्रोत-साधन को व्यवस्था गर्ने।

source: As he talked to the residents in that community center, he talked about two concepts.
ne: जसै उहाँले त्यस समाज का नागरिकहरूसँग बोल्नुभयो, उहाँले दुई बिचारका बारेमा बोल्नुभो।

source: He talked about "the world as it is" and "the world as it should be."
ne: उहाँले "यो विश्व अहिले कस्तो छ" र "यो विश्व कस्तो हुनुपर्ने हो" भन्नेबारेमा बोल्नुभयो।

source: And I talked about this throughout the entire campaign.
ne: अनि मैले यस बारेमा चुनाव प्रचार अभियानभरि बोलें।

source: What he said, that all too often, is that we accept the distance between those two ideas.
ne: उहाँले भन्नुहुन्थ्यो, कि धेरै पटक, हामीले यी दुई बिचार बिचको दुरीलाई स्वीकार्छौं।

source: And sometimes we settle for the world as it is, even when it doesn't reflect our values and aspirations.
ne: अनी कहिलेकाहीं हामी अहिलेको विश्व जस्ताको तस्तै लिन्छौं , त्यसमा हाम्रा सिद्धान्त र हाम्रो प्रयासहरू नझल्किएकै भए पनि।

source: But Barack reminded us on that day, all of us in that room, that we all know what our world should look like.
ne: तर बराकले हामीलाई त्यो दिन सम्झाउनुभयो, त्यो कोठामा भएका सबैलाई, कि हामी सबैलाई थाहा छ हाम्रो विश्व कस्तो हुनुपर्छ भनेर।

source: We know what fairness and justice and opportunity look like.
ne: हामीलाई थाहा छ स्वच्छन्दता र कानुन अनि अवसर कस्ता हुन्छन भनेर।

source: We all know.
ne: हामी सबैलाई थाहा छ।

source: And he urged the people in that meeting, in that community, to devote themselves to closing the gap between those two ideas, to work together to try to make the world as it is and the world as it should be, one and the same.
ne: अनी उहाँले आह्वान गर्नुभयो त्यहाँ भेला भएका व्यक्तिलाई, त्यस समाजमा बस्नेहरूलाई, कटिबद्ध हुनको लागि ती दुई बिचार बिचको दुरी मेटाउनका लागि, यो विश्व जस्तो हुनुपर्ने हो, र अहिले जस्तो छ, दुबै स्थितिलाई एक बनाउन, एकजुट हुनका लागि।

source: And I think about that today because I am reminded and convinced that all of you in this school are very important parts of closing that gap.
ne: अनि म आज यसबारेमा सोच्दैछु किनभने मलाई आभास भएको छ, र म विश्वसत छु कि तपाईँहरू यस विद्यालयका सबैजना यो दुरी मेटाउने महत्वपूर्ण भाग हुनुहुन्छ भनेर।

source: You are the women who will build the world as it should be.
ne: तपाईंहरू नै ती महिलाहरु हुनुहुन्छ जस्ले यो विश्व जस्तो हुनुपर्नेहो त्यस्तै बनाउनेछ।

source: You're going to write the next chapter in history.
ne: तपाईंहरूले ईतिहासको अर्को अध्याय लेख्नुहुनेछ।

source: Not just for yourselves, but for your generation and generations to come.
ne: आफ्ना लागि मात्र होइन, यो पुस्ताकै लागि, अनि आउँदा पुस्ताहरूको लागि।

source: And that's why getting a good education is so important.
ne: त्यसैले राम्रो शिक्षा पाउन, अति महत्वपूर्ण छ।

source: That's why all of this that you're going through -- the ups and the downs, the teachers that you love and the teachers that you don't -- why it's so important.
ne: त्यसैले जे बाट तपाईं गुज्रिरहनुभएको छ -- उतार-चढावहरू, तपाईँले माया गर्ने शिक्षकहरू र तपाईँले माया नगर्ने शिक्षकहरू यो सबै कुरा अत्यन्त महत्वपूर्ण छ।

source: Because communities and countries and ultimately the world are only as strong as the health of their women.
ne: किनकी समाज अनि देशहरू अनि अन्त्यमा यो विश्व त्यति नै बलियो हुन्छ जति त्यहाँका महिलाहरुको स्वास्थ्य छ।

source: And that's important to keep in mind.
ne: अनि त्यो कुरा दिमागमा राख्न जरुरी छ।

source: Part of that health includes an outstanding education.
ne: अनि त्यो स्वास्थ्यको एक भाग उत्कृष्ट शिक्षा हो।

source: The difference between a struggling family and a healthy one is often the presence of an empowered woman or women at the center of that family.
ne: दु:ख पाईरहेको परिवार र एउटा स्वस्थ परिवारको फरक सामान्यतया एक शक्तिसम्पन्न नारी वा नरीहरूको परिवारको केन्द्रमा उपस्थिति हो।

source: The difference between a broken community and a thriving one is often the healthy respect between men and women who appreciate the contributions each other makes to society.
ne: एउटा टुटेको समाज र एउटा जल्दोबल्दो समाज बिचको भिन्नता, धेरैचोटी पुरुष र महिला बिचको स्वस्थ इज्जत र एक अर्काले समाजको लागि दिएको योगदानप्रतिको कृतज्ञतामा हुन्छ।

source: The difference between a languishing nation and one that will flourish is the recognition that we need equal access to education for both boys and girls.
ne: एउटा तेजहीन राष्ट्र र एउटा फल्न-फुल्नलागेको राष्ट्र बिचको भिन्नता, शिक्षाको पहुँच केटा र केटी दुबैलाई बराबरी रुपमा चहिन्छ भन्ने कुरा चिन्नसक्नुमा हुन्छ।

source: And this school, named after the U.K.'s first female doctor, and the surrounding buildings named for Mexican artist Frida Kahlo, Mary Seacole, the Jamaican nurse known as the "black Florence Nightingale," and the English author, Emily Bronte, honor women who fought sexism, racism and ignorance, to pursue their passions to feed their own souls.
ne: अनि यो विद्यालय, युकेको पहिलो महिला डाक्टरका नाममा राखिएको, अनी छेउछाउका भवनहरू मेक्सिकन चित्रकार फ्रिडा काह्लोका नाममा, अनि, मेरी सीएकोल, जमैकन नर्स जस्लाई "कालाजातिकी फ्लोरेन्स नाइटइङगल" भनेर चिनिन्थ्यो, अनी अङ्रेजी लेखिका, एमिली ब्रोन्टे, ती महिलाहरुलाई जस्ले लैङ्गिक भेदभाव, जातीयता र तामसका बिरुद्ध लडे, तिनीहरूलाई आदर गरौँ, जस्ले आफ्ना चाहनलाई पछ्याए, आफ्नो आत्माशान्ति को लागि।

source: They allowed for no obstacles.
ne: उहाँहरूले कुनै अवरोध आउन दिनुभएन।

source: As the sign said back there, "without limitations."
ne: त्यहाँ पछाडि लेखिएजस्तै , "कुनै रोकटोक बिना"

source: They knew no other way to live than to follow their dreams.
ne: उहाँहरूलाई बाँच्ने अरु कुनै तरिका नै थाहा थिएन आफ्ना सपनाहरूलाई पछ्याउन बाँच्ने बहेक।

source: And having done so, these women moved many obstacles.
ne: अनी त्यसै गरेर, यी महिलाहरुले धेरै अवरोध हटाउनुभयो।

source: And they opened many new doors for millions of female doctors and nurses and artists and authors, all of whom have followed them.
ne: अनी उहाँहरूले धेरै नयाँ ढोकाहरू खोल्दिनुभयो दशौँ लाख महिला डाक्टर र नर्स र चित्रकार र लेखिकाहरूलाई, जसले उहाँहरूलाई पछ्याउनु भयो।

source: And by getting a good education, you too can control your own destiny.
ne: अनि राम्रो शिक्षा पाएपछी, तपाईंहरूले पनि आफ्नो भविश्य आफ्नो हातामा लिन सक्नुहुन्छ।

source: Please remember that.
ne: कृपया यो सम्झिनुहोला।

source: If you want to know the reason why I'm standing here, it's because of education.
ne: तपाईंहरूलाई म यहाँ उभिएको कारण थाहा पाउनु छ भने, त्यो शिक्षाकै कारण हो।

source: I never cut class. Sorry, I don't know if anybody is cutting class.
ne: मैले कहिले पनि क्लास छाडिन। माफ गर्नुहोला मलाई थाहा छैन तपाईंहरूमध्ये कसैले क्लास छाडछ कि छाडदैन भनेर।

source: I never did it.
ne: मैलेचाहिँ कहिलै छाडिन।

source: I loved getting As.
ne: मलाई 'ए' ल्याउन धेरै मनपर्थ्यो।

source: I liked being smart.
ne: मलाई चतुर हुन मन पर्थ्यो।

source: I liked being on time. I liked getting my work done.
ne: मलाई समयमै काम गर्न मनपर्थ्यो। मलाई मेरो काम सक्न मनपर्थ्यो।

source: I thought being smart was cooler than anything in the world.
ne: मलाई चतुर हुन जस्तो राम्रो संसारमा अरु केही लाग्दैनथ्यो।

source: And you too, with these same values, can control your own destiny.
ne: अनि तपाईंहरूले पनि, यिनै मान्यताहरूले, आफ्नो भविश्य आफ्नो हातमा लिन सक्नुहुन्छ।

source: You too can pave the way.
ne: तपाईंहरूले पनि बाटो बनाउन सक्नुहुन्छ।

source: You too can realize your dreams, and then your job is to reach back and to help someone just like you do the same thing.
ne: आफ्नो सपना पुरा गर्न सक्नुहुन्छ, अनि तपाईंको काम हुनेछ पछाडि फर्केर आफुजस्तै कसैलाई आफुजस्तै बन्न मद्दत गर्ने।

source: History proves that it doesn't matter whether you come from a council estate or a country estate.
ne: ईतिहासले दर्शाउँछ कि, मतलब छैन तपाईं सरकारले दिएको आबासबाट आउनुभएको होस या आफ्नो ठुलो बङगलाबाट।

source: Your success will be determined by your own fortitude, your own confidence, your own individual hard work.
ne: तपाईंको सफलता भरपर्छ तपाईँकै जेहेन्दारी मा, तपाईँकै आत्मविश्वासमा, तपाईँकै परिश्रममा।

source: That is true. That is the reality of the world that we live in.
ne: त्यही सत्य हो। त्यही नै हामी बस्ने यो विश्वको वस्तबिकता हो।

source: You now have control over your own destiny.
ne: तपाईंको भविश्य अहिले तपाईंकै हातमा छ।

source: And it won't be easy -- that's for sure.
ne: अनि यो सजिलो हुनेछैन। त्यो पक्कै हो।

source: But you have everything you need.
ne: तर तपाईंसँग चाहिएको सबैथोक छ।

source: Everything you need to succeed, you already have, right here.
ne: सफल हुन चहिने सबैकुरा, अहिले तपाईंसँगै छ।

source: My husband works in this big office.
ne: मेरो श्रीमान एउटा ठुलो कार्यालयमा काम गर्नुहुन्छ।

source: They call it the Oval Office.
ne: त्यसलाई "द ओभल अफिस" भनिन्छ।

source: In the White House, there's the desk that he sits at -- it's called the Resolute desk.
ne: व्ह्वाइट हाउसमा, एउटा "डेस्क" छ जस्मा उहाँ बस्नुहुन्छ। त्यसलाई "द रेसोलुट डेस्क" भनिन्छ।

source: It was built by the timber of Her Majesty's Ship Resolute and given by Queen Victoria.
ne: यो "हर म्याजेस्टीज सिप रेजोल्युट"को काठ बाट बनेको थियो र रानी विक्टोरयाले दिएकी हुन।

source: It's an enduring symbol of the friendship between our two nations.
ne: यो दुई देश बिचको लामो र गहिरो मित्रताको प्रतीक हो।

source: And its name, Resolute, is a reminder of the strength of character that's required not only to lead a country, but to live a life of purpose, as well.
ne: अनि यसको नाम, "अडान" ले त्यो आवश्यक चरित्र को शक्तिको याद दिलाउँछ, जुन देश हाँक्न मात्र होइन, तर एउटा अर्थपूर्ण जीवन बिताउन पनि महत्वपूर्ण हुन्छ।

source: And I hope in pursuing your dreams, you all remain resolute, that you go forward without limits, and that you use your talents -- because there are many; we've seen them; it's there -- that you use them to create the world as it should be.
ne: अनि म आशा गर्छु आफ्ना सपना पहिल्याउन, तपाईंहरु सबै अडिग रहनुहुन्छ भनेर, कि तपाईंहरू कुनैपनि सीमाभन्दा पर जानलाई, अनी आफ्नो बुद्धिको प्रयोग गर्नलाई -- किनकि त्यस्ता सीमा र आवरोध धेरै छन। हामीले देखेका छौँ। तिनीहरू छन। किनकि तपाईंहरुले तिनीहरूको प्रयोग विश्व जस्तो हुनुपर्ने त्यस्तै बनाउन प्रयोग गर्नुहुन्छ भनेर।

source: Because we are counting on you.
ne: किनकि हामी तपाईंहरूमा भर परेका छौं।

source: We are counting on every single one of you to be the very best that you can be.
ne: हामी तपाईंहरूमध्ये हर एक जनाको भर परेका छौं कि तपाईंहरू आफुले सम्भव भए जति बन्नुहुन्छ भनेर।

source: Because the world is big.
ne: किनकि संसार ठूलो छ।

source: And it's full of challenges.
ne: र यो चुनौतिहरूले भरिएको छ।

source: And we need strong, smart, confident young women to stand up and take the reins.
ne: र हामीलाई बल, बुद्धि र आत्मविश्वासले भरिएका युवतीहरूको आवश्यकता छ उठेर लगाम आफ्नो हातमा लिनको लागि।

source: We know you can do it. We love you. Thank you so much.
ne: हामीलाई थाहा छ तपाईंहरूले गर्न सक्नुहुन्छ भनेर। हामी तपाईंलाई माया गर्छौं। धेरै धेरै धन्यवाद।

source: Now, if President Obama invited me to be the next Czar of Mathematics, then I would have a suggestion for him that I think would vastly improve the mathematics education in this country.
ne: अहिले, यदि राष्ट्रपति ओबामाले मलाई गणितको अर्को बडा हाकिम बन्न बोलाए भने मलाई लाग्छ ऊनलाई मेरो एउटा सुझाव हुनेछ कि यो देशको गणित शिक्षालाई व्यापक सुधार गर्नुपर्छ।

source: And it would be easy to implement and inexpensive.
ne: र यो लागू गर्न सजिलो अनि कम खर्चिलो हुनेछ।

source: The mathematics curriculum that we have is based on a foundation of arithmetic and algebra.
ne: हाम्रो गणित पाठ्यक्रम अङ्क र बीजगणितको जगमा आधारित छ।

source: And everything we learn after that is building up towards one subject.
ne: र हामीले त्यसपछि हामीले सिक्ने सबैकुरा एउटा बिषयतिर अघि बढ्छ।

source: And at top of that pyramid, it's calculus.
ne: अनि त्यो पिरामीडको टुप्पोमा क्याल्कुलस हुन्छ।

source: And I'm here to say that I think that that is the wrong summit of the pyramid ...
ne: र मैले यहाँ भन्न चाहन्छु कि मेरो बिचारमा त्यो पिरामीडको गलत टुप्पो हो ...

source: that the correct summit -- that all of our students, every high school graduate should know -- should be statistics: probability and statistics.
ne: सही टुप्पो -- हाम्रा सबै विद्यार्थीहरूले, सबै उच्च माध्यमिक पास गर्नेले जान्नु पर्ने कुरो -- त तथ्याङ्क पो हुनुपर्छ। सम्भाव्यता र तथ्याङ्क।

source: (Applause) I mean, don't get me wrong. Calculus is an important subject.
ne: (ताली) मेरो मतलव, मलाई गलत नसोच्नुस। तथ्याङ्क एउटा महत्वपूर्ण विषय हो।

source: It's one of the great products of the human mind.
ne: यो मानव मस्तिष्कको एउटा महान उपज हो।

source: The laws of nature are written in the language of calculus.
ne: प्रकृतिका नियमहरू क्याल्कुलसको भाषामा लेखिएका छन।

source: And every student who studies math, science, engineering, economics, they should definitely learn calculus by the end of their freshman year of college.
ne: र प्रत्येक विद्यार्थी जसले गणित, विज्ञान, अभियान्त्रिकी, अर्थशाष्त्र पढ्छन उनीहरूले कलेजको पहिलो वर्षको अन्त्यसम्म क्याल्कुलस अबश्य सिक्नु पर्छ।

source: But I'm here to say, as a professor of mathematics, that very few people actually use calculus in a conscious, meaningful way, in their day-to-day lives.
ne: तर मैले यहाँ यो भन्न चाहन्छु, गणितको प्रध्यापकका नाताले, कि वास्तवमा धेरै थोरै व्यक्तिहरू ऊनीहरूको दैनिक जीवनमा सचेत, अर्थपुर्ण रुपमा क्याल्कुलसको प्रयोग गर्छन।

source: On the other hand, statistics -- that's a subject that you could, and should, use on daily basis. Right?
ne: अर्कोतिर, तथ्याङ्क -- त्यस्तो विषय हो जुन तपाईँले दैनिक रुपमा प्रयोग गर्न सक्नुहुन्छ, र गर्नुहुन्छ। हैन त?

source: It's risk. It's reward. It's randomness.
ne: यो जोखिम हो। यो प्रतिफल हो। यो क्रमरहित हो।

source: It's understanding data.
ne: यो तथ्य बुझ्नु हो।

source: I think if our students, if our high school students -- if all of the American citizens -- knew about probability and statistics, we wouldn't be in the economic mess that we're in today. (Laughter) (Applause) Not only -- thank you -- not only that ...
ne: मलाई लाग्छ यदि हाम्रा विद्यार्थीहरूले, यदि हाम्रा उच्च माध्यमिक विद्यार्थीहरूले -- यदि सबै अमेरिकी नागरिकहरूले -- सम्भाव्यता र तथ्याङ्कको बारेमा जानेका भए, हामी अहिले भईराखेको अर्थतन्त्रको अस्तव्यस्ततामा हुन्नथ्यौँ। त्यति मात्र -- धन्यवाद -- त्यति मात्र हैन --

source: but if it's taught properly, it can be a lot of fun.
ne: [तर] यदि यो राम्ररी पढाईयो भने, यो धेरै नै रमाईलो हुन सक्छ।

source: I mean, probability and statistics, it's the mathematics of games and gambling.
ne: मेरो मतलव, सम्भाव्यता र तथ्याङ्क, यो खेलहरू र जुवाको गणित हो।

source: It's analyzing trends. It's predicting the future.
ne: यो झुकावहरूको विश्लेषण हो। यो भविश्यको अनुमान हो।

source: Look, the world has changed from analog to digital.
ne: हेर्नुस, विश्व एनालगबाट डिजिटलमा परिवर्तन भएको छ।

source: And it's time for our mathematics curriculum to change from analog to digital, from the more classical, continuous mathematics, to the more modern, discrete mathematics -- the mathematics of uncertainty, of randomness, of data -- that being probability and statistics.
ne: र यो समय हाम्रो गणित पाठ्यक्रम एनालगबाट डिजिटलमा परिवर्तन गर्ने समय हो। अझ प्राचीन, अविरल गणितबाट आधुनिक, डिस्कृट गणिततर्फ। अनिश्चितताको गणित, क्रमविहीनताको, तथ्यको -- गणित, सम्भाव्यता र तथ्याङ्क हो।

source: In summary, instead of our students learning about the techniques of calculus, I think it would be far more significant if all of them knew what two standard deviations from the mean means. And I mean it.
ne: छोटकरीमा, हाम्रा विद्यार्थीहरू क्याल्कुलसका हिसाब गर्ने तरिकाहरु सिक्नुको सट्टा, मध्यमा बाट दुई स्ट्याण्डर्ड डेभिएसनहरू भनेको के हो भन्ने कुरा यदि सबैले जानेको भए एकदमै सार्थक हुन्थ्यो। र यो मेरो आशय हो।

source: Two years ago, I stood on the TED stage in Arusha, Tanzania.
ne: दुइ वर्ष अगाडि म तान्जानियाको अरुशामा 'टेड' को मंचमा बोलेको थिएँ,

source: I spoke very briefly about one of my proudest creations.
ne: मैले एकदमै संक्षेपमा मेरो एउटा बिशिस्ठ सिर्जनाको बारेमा बोलेको थिएँ|

source: It was a simple machine that changed my life.
ne: यो एउटा सामान्य मेशिन थियो जसले मेरो जिन्दगि नै परिवर्तन गरिदियो|

source: Before that time, I had never been away from my home in Malawi.
ne: त्यो भन्दा अगाडि म कहिले पनि मेरो मलावीमा भएको घरबाट बाहिर हिडेको थिईन|

source: I had never used a computer.
ne: मैले कहिल्यै कम्पुटर प्रयोग गरेको पनि थिईन|

source: I had never seen an Internet.
ne: मैले कहिल्यै इन्टरनेट भन्ने पनि देखेको थिईन|

source: On the stage that day, I was so nervous.
ne: अनि त्यो दिन, मंचमा म निकै अत्तालिएको थिएँ|

source: My English lost, I wanted to vomit.
ne: मेरो बोली हरायो| म बान्ता गर्न चाहन्थे|

source: (Laughter) I had never been surrounded by so many azungu, white people.
ne: (हाँसो) म त्यती धेरै खैरा र गोरा मान्छेहरुबाट कहिल्यै पनि घेरिएको थिईन/

source: (Laughter) There was a story I wouldn't tell you then.
ne: (हाँसो) त्यहाँ एउटा यस्तो कथा थियो कि जुन मैले सुनाउने थिईन|

source: But well, I'm feeling good right now.
ne: तर ठिकै छ, अहिले त म राम्रै अनुभव गर्दै छु |

source: I would like to share that story today.
ne: म त्यो कथा आज भन्न चाहन्छु |

source: We have seven children in my family.
ne: हामी सात जना बच्चाहरु छौ हाम्रो परिवारमा|

source: All sisters, excepting me.
ne: सबै बहिनिहरु, म बाहेक |

source: This is me with my dad when I was a little boy.
ne: यो चाही म हु मेरो बुबासँग, जतिखेर म बच्चा थिएँ |

source: Before I discovered the wonders of science, I was just a simple farmer in a country of poor farmers.
ne: मैले बिज्ञानको चमत्कार पत्ता लगाउनु भन्दा पहिले, म एउटा सामान्य किसान थिएँ एउटा गरीब किसानहरुको देशको/

source: Like everyone else, we grew maize.
ne: अरुहरुले जस्तै, हामीले मकै खेति गर्थ्यौ/

source: One year our fortune turned very bad.
ne: एउटा वर्षमा चाही हाम्रो भाग्य एकदमसँग बिग्रियो|

source: In 2001 we experienced an awful famine.
ne: सन् २००१ मा हामीले साह्रै नराम्रो खडेरी बेहोर्नु पर्यो|

source: Within five months all Malawians began to starve to death.
ne: त्यसको पाँच महिना भित्र सबै मलावीका जनता भोकमरीले मर्न थाले|

source: My family ate one meal per day, at night.
ne: हाम्रो परिवारले दिनमा एक छाक मात्र खान्थ्यौँ, बेलुका मात्र|

source: Only three swallows of nsima for each one of us.
ne: त्यो पनि हरेकको लागि जम्मा तीन गास मकैको ढिडो मात्र|

source: The food passes through our bodies.
ne: र त्यो खाना हाम्रो शरीरमा सिंचित त हुन्थ्यो

source: We drop down to nothing.
ne: तर पेटसम्म पुग्न पाउदैनथ्यो|

source: In Malawi, the secondary school, you have to pay school fees.
ne: मलावीमा, माध्यमिक शिक्षाको लागि पैसा तिर्नु पर्छ|

source: Because of the hunger, I was forced to drop out of school.
ne: भोकमरी लागेपछि, म स्कुलबाट निक्लिन बाध्य भएँ|

source: I looked at my father and looked at those dry fields.
ne: मैले आफ्नो बुबालाई हेरें, अनि त्यो सुख्खा खेतलाई हेरें|

source: It was the future I couldn't accept.
ne: र यो नै मेरो भबिष्य थियो जुन म स्वीकार गर्न सक्दिनथे|

source: I felt very happy to be at the secondary school, so I was determined to do anything possible to receive education.
ne: म माध्यमिक तहमा भर्ना हुदा निकै खुसि थिएँ| त्यसैले म शिक्षाको लागि जे पनि गर्न सक्छु भन्ने कुरामा प्रतिबद्ध थिएँ|

source: So I went to a library.
ne: त्यसैले म पुस्तकालय गएँ,

source: I read books, science books, especially physics.
ne: मैले किताबहरु पढे, बिज्ञानका , बिशेषतः भौतिक शास्त्रका|

source: I couldn't read English that well.
ne: मैले अंग्रेजी पढ्न त्यती राम्रो जान्दिनथें|

source: I used diagrams and pictures to learn the words around them.
ne: त्यसैले मैले चित्र र तस्बिरहरुको सहारामा त्यहाँ लेखेका शब्द हरु बुझ्दथें |

source: Another book put that knowledge in my hands.
ne: एउटा किताबले मलाई यो दिव्यज्ञान मेरो हत्केलामा राखिदियो|

source: It said a windmill could pump water and generate electricity.
ne: यसमा भनिएको थियो कि विन्डमिलले पानीलाई पम्प गरेर बिधुत पैदा गर्न सक्छ|

source: Pump water meant irrigation, a defense against hunger, which we were experiencing by that time.
ne: पानी पम्प गरिनु अर्थात् सिचाई भोकमरीकोको प्रतिरक्षा, जुन हामीले त्यो समयमा सामना गरि राखेका थियौं |
